{
  "articles": [
    {
      "id": "1",
      "category": "BOOKS",
      "name": "The Pragmatic Programmer. From Journeyman to Master",
      "description": "Programmers are craftspeople trained to use a certain set of tools (editors, object managers, version trackers) to generate a certain kind of product (programs) that will operate in some environment (operating systems on hardware assemblies). Like any other craft, computer programming has spawned a body of wisdom, most of which isn't taught at universities or in certification classes. Most programmers arrive at the so-called tricks of the trade over time, through independent experimentation. In The Pragmatic Programmer, Andrew Hunt and David Thomas codify many of the truths they've discovered during their respective careers as designers of software and writers of code.",
      "reviews": [
        {
          "id": "1-1",
          "author": "James Leibert",
          "date": "2015-10-18T00:00:00+00:00",
          "rating": 3,
          "text": "Inconsistent, but some gems."
        },
        {
          "id": "1-2",
          "author": "Peter J. Hanson",
          "date": "2015-06-30T00:00:00+00:00",
          "rating": 5,
          "text": "starsLearn. Think. Program. Perfect."
        },
        {
          "id": "1-3",
          "author": "William",
          "date": "2016-09-04T00:00:00+00:00",
          "rating": 5,
          "text": "A Classic"
        }
      ]
    },
    {
      "id": "2",
      "category": "BOOKS",
      "name": "Clean Code: A Handbook of Agile Software Craftsmanship (Robert C. Martin)",
      "description": "Even bad code can function. But if code isn't clean, it can bring a development organization to its knees. Every year, countless hours and significant resources are lost because of poorly written code. But it doesn't have to be that way. Noted software expert Robert C. Martin presents a revolutionary paradigm with Clean Code: A Handbook of Agile Software Craftsmanship. Martin has teamed up with his colleagues from Object Mentor to distill their best agile practice of cleaning code \"on the fly\" into a book that will instill within you the values of a software craftsman and make you a better programmer--but only if you work at it. What kind of work will you be doing? You'll be reading code--lots of code. And you will be challenged to think about what's right about that code, and what's wrong with it. More importantly, you will be challenged to reassess your professional values and your commitment to your craft. Clean Code is divided into three parts. The first describes the principles, patterns, and practices of writing clean code. The second part consists of several case studies of increasing complexity.Each case study is an exercise in cleaning up code--of transforming a code base that has some problems into one that is sound and efficient. The third part is the payoff: a single chapter containing a list of heuristics and \"smells\" gathered while creating the case studies. The result is a knowledge base that describes the way we think when we write, read, and clean code. Readers will come away from this book understanding *How to tell the difference between good and bad code *How to write good code and how to transform bad code into good code *How to create good names, good functions, good objects, and good classes *How to format code for maximum readability *How to implement complete error handling without obscuring code logic *How to unit test and practice test-driven developmentThis book is a must for any developer, software engineer, project manager, team lead, or systems analyst with an interest in producing better code.",
      "reviews": [
      ]
    },
    {
      "id": "3",
      "category": "BOOKS",
      "name": "Cracking the Coding Interview: 189 Programming Questions and Solutions",
      "description": "I am not a recruiter. I am a software engineer. And as such, I know what it's like to be asked to whip up brilliant algorithms on the spot and then write flawless code on a whiteboard. I've been through this as a candidate and as an interviewer. Cracking the Coding Interview, 6th Edition is here to help you through this process, teaching you what you need to know and enabling you to perform at your very best. I've coached and interviewed hundreds of software engineers. The result is this book. Learn how to uncover the hints and hidden details in a question, discover how to break down a problem into manageable chunks, develop techniques to unstick yourself when stuck, learn (or re-learn) core computer science concepts, and practice on 189 interview questions and solutions.",
      "reviews": [
        {
          "id": "3-1",
          "author": "David C.",
          "date": "2015-10-23T00:00:00+00:00",
          "rating": 5,
          "text": "If you only want to use one book, this is it"
        },
        {
          "id": "3-2",
          "author": "Paul Ewing",
          "date": "2016-12-26T00:00:00+00:00",
          "rating": 5,
          "text": "An excellent investment"
        },
        {
          "id": "3-3",
          "author": "PowerAtom",
          "date": "2017-02-19T00:00:00+00:00",
          "rating": 4,
          "text": "Wonderful book with some caveats"
        }
      ]
    },
    {
      "id": "4",
      "category": "DEVICES",
      "name": "Amazon Echo",
      "description": "Amazon Echo is a hands-free speaker you control with your voice. Echo connects to the Alexa Voice Service to play music, make calls, send and receive messages, provide information, news, sports scores, weather, and more—instantly. All you have to do is ask.",
      "reviews": [
        {
          "id": "4-1",
          "author": "Alex S",
          "date": "2015-06-19T00:00:00+00:00",
          "rating": 5,
          "text": "Already very practical for overcoming disability issues"
        },
        {
          "id": "4-2",
          "author": "FNK",
          "date": "2017-03-07T00:00:00+00:00",
          "rating": 2,
          "text": "Terrible software - Good people behind it"
        },
        {
          "id": "4-3",
          "author": "Dame Nicky",
          "date": "2016-08-16T00:00:00+00:00",
          "rating": 1,
          "text": "Paperweight! It died just after a year, and Amazon won't help! BEWARE it has only a 1 year warranty!"
        }
      ]
    },
     {
      "id": "5",
      "category": "DEVICES",
      "name": "Huawei Honor 8",
      "description": "You have the power to push culture forward. That's why Honor created a phone for you- the new Honor 8. It's the smartphone that opens your eyes to a world of possibilities. The innovative Bionic 12MP Dual lenses of the Honor 8 are your eyes to the world. One lens allows for rich color and the other lens is Monochrome to give you more light and increased sharpness. Together they help you capture crisper, more detailed photos day and night. Plus, the Fusion focus technology of laser, depth, and contrast helps you take the best pictures- even under the most challenging conditions. The premium, slick body of the Honor 8 is made with heavy Dual glass- front and back. Its aluminum alloy, 15-layer craftsmanship, and light-catching glass finish makes you Stand out from the crowd. Supported by smart power 4.0, the Honor 8 has maximum long-lasting battery life that lasts all day and fast-charging technology to reach 47% power in just 30 minutes. So when you're out there changing the world, Honor 8 has you covered- with up to 10 hours of nonstop video playback and a speedy recharge. The Honor 8: beautiful design, top-flight Specs, game-changing camera technology, and maximum power. Honor 8 - eyes to the world.",
      "reviews": [
        {
          "id": "5-1",
          "date": "2017-05-10T00:00:00+00:00",
          "rating": 5,
          "text": "Outstanding!"
        },
        {
          "id": "5-2",
          "author": "TC101",
          "date": "2017-05-05T00:00:00+00:00",
          "rating": 3,
          "text": "Huawei could have been the best phone company out there. It is truly a shame."
        },
        {
          "id": "5-3",
          "author": "D. Bez",
          "date": "2016-08-28T00:00:00+00:00",
          "rating": 4,
          "text": "starsAfter a few days and many tweaks, I love this phone with some frustrations"
        }
      ]
    }
  ],
  "recommendations": [
    ["1", "3"],
    ["2", "4"]
  ]
}
